app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@title = @heading ='Players'
		@users = User.all

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "nation", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(params[:user])
		if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.com', "nation" = 'england', "encrypted_password" = '1e27d87f148a6e57e2bda0a6cbd35fb14c2149c73afe1ec5a78d872b6f0da616', "updated_at" = '2013-08-08 14:32:18.608735' WHERE "users"."id" = 1
---
	def update
		@user = User.find(params[:id])

		if @user.update_attributes(params[:user])